# Задача «Длина слова».
a = "произвольную строку"
print(len(a))

# Задача «Суммы и разности».
first = 3
second = 2
summa = first + second
diff = first - second
print(summa, diff)

# Задача «Среднее арифметическое».
first = 3
second = 2
third = 4
mean = (first + second + third) / 3
print(mean)

# Задача «Простые строчки».
first_string = "Вторник"
second_string = "Понедельник"
print(f"{second_string}, {first_string}")

# Задача «Сложная формула».
a, b, c = 1, 2, 3
f = a * (b + c)
print((f ** 3) / 2)
